# Developer
brew "git"
brew "git-lfs"
brew "diff-so-fancy"
brew "gemini-cli"
brew "direnv"
brew "volta"
brew "cocoapods"
brew "ack"
brew "yamlfmt"
brew "fastlane"
brew "tig"
brew "gh"
brew "yq"
brew "wget"
brew "withgraphite/tap/graphite"

cask "claude-code"
cask "gpg-suite"
cask "orbstack"
cask "ngrok"
cask "gcloud-cli"
cask "jetbrains-toolbox"

tap "f1bonacc1/tap"
brew "process-compose"

tap "menubar-apps/menubar-apps"
cask "pullbar"

# Necessary tools
cask "google-chrome"
cask "1password"
cask "iterm2"
cask "cursor"
cask "setapp"
cask "monitorcontrol"

# Work
cask "slack"
cask "drata-agent"
cask "expo-orbit"

# Handy tools
cask "sizeup"
cask "scroll-reverser"
cask "jordanbaird-ice"
cask "hammerspoon"

tap "lihaoyun6/tap"
cask "airbattery"

tap "buo/cask-upgrade"

# Other
cask "telegram"
cask "discord"
cask "zoom"
