# Developer
brew "git"
brew "diff-so-fancy"
brew "gemini-cli"
brew "direnv"
cask "claude-code"
cask "gpg-suite"
cask "orbstack"

# Necessary tools
cask "google-chrome"
cask "1password"
cask "iterm2"
cask "cursor"
cask "setapp"

# Work
cask "slack"

# Handy tools
cask "sizeup"
cask "scroll-reverser"
cask "jordanbaird-ice"

# Other
cask "telegram"
cask "discord"