# Developer
brew "git"
brew "diff-so-fancy"
brew "gemini-cli"
brew "direnv"
brew "volta"
brew "cocoapods"
brew "ack"
brew "yamlfmt"
cask "claude-code"
cask "gpg-suite"
cask "orbstack"
cask "ngrok"

tap "f1bonacc1/tap"
brew "process-compose"

# Necessary tools
cask "google-chrome"
cask "1password"
cask "iterm2"
cask "cursor"
cask "setapp"

# Work
cask "slack"

# Handy tools
cask "sizeup"
cask "scroll-reverser"
cask "jordanbaird-ice"
cask "hammerspoon"

# Other
cask "telegram"
cask "discord"